tap 'jmespath/jmespath'
tap 'stripe/stripe-cli'
tap 'supabase/tap'
tap 'temporalio/brew'
tap 'daytonaio/cli'
tap 'steveyegge/beads'
tap 'heroku/brew'
tap 'eth-p/software'
tap 'warrensbox/tap'

# cli tools
brew 'ack'
brew 'autoconf'
brew 'autoenv'
brew 'autojump'
brew 'automake'
brew 'awscli'
brew 'bat'
brew 'cmake'
brew 'coreutils'
brew 'ctags'
brew 'daemon'
brew 'diff-so-fancy'
brew 'editorconfig'
brew 'fd'
brew 'ffmpeg'
brew 'fish'
brew 'gh'
brew 'go'
brew 'gsed'
brew 'hadolint'
brew 'hugo'
brew 'jid'
brew 'jmespath/jmespath/jp'
brew 'jo'
brew 'jq'
brew 'moreutils'
brew 'ncdu'
brew 'pv'
brew 'ripgrep'
brew 'the_silver_searcher'
brew 'tmux'
brew 'translate-shell'
brew 'vale'
brew 'vim'
brew 'wget'
brew 'xmlstarlet'
brew 'yq'

# languages & runtimes
brew 'mise'
brew 'python'
brew 'ruby'
brew 'scala'

# version management
brew 'warrensbox/tap/tfswitch'

# libraries
brew 'bzip2'
brew 'freetype'
brew 'gdbm'
brew 'gettext'
brew 'icu4c'
brew 'jpeg'
brew 'libevent'
brew 'libgpg-error'
brew 'libksba'
brew 'libmagic'
brew 'libpng'
brew 'libtiff'
brew 'libtool'
brew 'libxml2'
brew 'libxslt'
brew 'libzip'
brew 'libyaml'
brew 'little-cms2'
brew 'openssl'
brew 'pcre'
brew 'pkg-config'
brew 'protobuf'
brew 'readline'
brew 'sqlite'
brew 'xz'
brew 'zlib'

# image processing
brew 'imagemagick'
brew 'jasper'

# databases
brew 'mysql'
brew 'pgvector'
brew 'postgresql@15'
brew 'redis'

# devops & cloud
brew 'act'
brew 'actionlint'
brew 'amazon-ecs-cli'
brew 'ansible'
brew 'aws-iam-authenticator'
brew 'azure-cli'
brew 'cfn-lint'
brew 'docker'
brew 'doctl'
brew 'helm'
brew 'kind'
brew 'kompose'
brew 'kubectl'
brew 'kubectx'
brew 'kube-ps1'
brew 'minikube'
brew 'nginx'
brew 'pre-commit'
brew 'pulumi'
brew 'temporal'
brew 'temporalio/brew/tcld'

# build tools
brew 'gradle'
brew 'maven'
brew 'yarn'
brew 'pnpm'

# git
brew 'bfg'
brew 'git-crypt'
brew 'git-extras'
brew 'git-filter-repo'
brew 'git-lfs'

# security
brew 'certstrap'
brew 'libfido2'
brew 'mkcert'
brew 'trufflehog'

# network
brew 'telnet'
brew 'telnetd'
brew 'tnftp'
brew 'tnftpd'

# misc tools
brew 'aspell'
brew 'beanstalk'
brew 'chroma'
brew 'eth-p/software/bat-extras'
brew 'heroku'
brew 'mackup'
brew 'mailhog'
brew 'pidof'
brew 'statusfy'
brew 'unixodbc'
brew 'vhs'
brew 'zsh-syntax-highlighting'

# third-party cli tools
brew 'daytonaio/cli/daytona'
brew 'gemini-cli'
brew 'flyctl'
brew 'railway'
brew 'steveyegge/beads/bd'
brew 'stripe/stripe-cli/stripe'
brew 'supabase/tap/supabase'
brew 'uv'

# cask apps
cask '1password'
cask '1password-cli'
cask 'alfred'
cask 'aws-vault'
cask 'bartender'
cask 'boost-note'
cask 'cakebrew'
cask 'chatgpt'
cask 'claude'
cask 'claude-code'
cask 'clipy'
cask 'codex'
cask 'copilot-cli'
cask 'cursor'
cask 'db-browser-for-sqlite'
cask 'dbngin'
cask 'discord'
cask 'displaylink'
cask 'divvy'
cask 'docker'
cask 'droplr'
cask 'fathom'
cask 'figma'
cask 'firefox'
cask 'gather'
cask 'gcloud-cli'
cask 'ghostty'
cask 'github'
cask 'google-chrome'
cask 'google-drive'
cask 'granola'
cask 'istat-menus'
cask 'iterm2'
cask 'kindle'
cask 'kiro'
cask 'lepton'
cask 'linear'
cask 'loom'
cask 'macvim'
cask 'microsoft-teams'
cask 'notion'
cask 'obs'
cask 'postman'
cask 'postico'
cask 'rescuetime'
cask 'screen-studio'
cask 'sequel-ace'
cask 'sequel-pro'
cask 'skype'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'sublime-text'
cask 'superhuman'
cask 'textmate'
cask 'transmit'
cask 'vagrant'
cask 'visual-studio-code'
cask 'vlc'
cask 'warp'
cask 'whatsapp'
cask 'windsurf'
cask 'wispr-flow'
cask 'xbar'
cask 'zed'
cask 'zoom'

# mac app store (requires: brew install mas)
brew 'mas'
mas 'BetterSnapTool', id: 417375580
