tap 'homebrew/brewdler'
tap 'homebrew/dupes'
tap 'homebrew/php'
tap 'homebrew/versions'
tap 'ValeLint/vale'
tap 'jmespath/jmespath'
brew 'ack'
brew 'libyaml'
brew 'openssl'
brew 'ansible'
brew 'autoconf'
brew 'autoenv'
brew 'autojump'
brew 'xz'
brew 'automake'
brew 'beanstalk'
brew 'go'
brew 'docker'
brew 'boot2docker'
brew 'cmake'
brew 'ctags'
brew 'daemon'
brew 'pcre'
brew 'editorconfig'
brew 'fish'
brew 'libpng'
brew 'freetype'
brew 'gdbm'
brew 'gettext'
brew 'git-extras'
brew 'icu4c'
brew 'libtool'
brew 'pkg-config'
brew 'jpeg'
brew 'libtiff'
brew 'readline'
brew 'sqlite'
brew 'python'
brew 'python3'
brew 'little-cms'
brew 'imagemagick'
brew 'jasper'
brew 'libevent'
brew 'libgpg-error'
brew 'libksba'
brew 'libxml2'
brew 'libxslt'
brew 'xmlstarlet'
brew 'mackup'
brew 'mhash'
brew 'mcrypt'
brew 'mongodb'
brew 'mysql'
brew 'ncdu'
brew 'phantomjs'
brew 'pidof'
brew 'ruby'
brew 'scala'
brew 'the_silver_searcher'
brew 'unixodbc'
brew 'wget'
brew 'homebrew/dupes/apple-gcc42'
brew 'homebrew/dupes/libiconv'
brew 'jq'
brew 'diff-so-fancy'
brew 'jo'
brew 'elasticsearch'
brew 'jid'
brew 'gradle'
brew 'tmux'
brew 'amazon-ecs-cli'
brew 'hadolint'
brew 'vale'
brew 'yarn'
brew 'vim', args: ['with-lua']
brew 'terraform'
brew 'amazon-ecs-cli'
brew 'jmespath'
brew 'translate-shell'
brew 'postgresql'
brew 'mkcert'
brew 'tnftp' 
brew 'tnftpd' 
brew 'telnet' 
brew 'telnetd'
brew 'kompose'
brew 'ripgrep'
brew 'fd'
